InformationRegisters/CRM_ИдентификаторыКартинок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ИдентификаторыКартинок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ИдентификаторыКартинок/Forms/ФормаСпискаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Неопределено = ТекДанные Тогда
		Возврат 
	КонецЕсли;
	Если (ТекДанные.Модель <> ТекМодель) ИЛИ (ТекДанные.Идентификатор <> ТекИдентификатор) Тогда
		ТекМодель = ТекДанные.Модель;
		ТекИдентификатор = ТекДанные.Идентификатор;
		ОбновитьАдресКартинки()
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресКартинки()
	
	АдресКартинки = "";
	Если ЗначениеЗаполнено(ТекМодель) И ЗначениеЗаполнено(ТекИдентификатор) Тогда
		КлючЗаписиРег = РегистрыСведений.КартинкиИФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,Идентификатор", ТекМодель, ТекИдентификатор)); 
		Если НЕ КлючЗаписиРег.Пустой() Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные")
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Неопределено = ТекДанные Тогда
		Возврат 
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Попытка
			Картинка = Новый Картинка(Диалог.ПолноеИмяФайла);
			ЗаписатьКартинку(Картинка, ТекДанные);
			Элементы.АдресКартинки.Обновить();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Неопределено = ТекДанные Тогда
		Возврат 
	КонецЕсли;
	Если Вопрос("Удалить фотографию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		УдалитьКартинку(ТекДанные);
		Элементы.АдресКартинки.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку(Картинка, ТекДанные)
	
	МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	МенеджерКартинки.Объект = ТекДанные.Модель;
	МенеджерКартинки.Идентификатор = ТекДанные.Идентификатор;
	МенеджерКартинки.Данные = Новый ХранилищеЗначения(Картинка);
	МенеджерКартинки.Записать(Истина);
	ОбновитьАдресКартинки()
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКартинку(ТекДанные)
	
	МенеджерКартинки = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	МенеджерКартинки.Объект = ТекДанные.Модель;
	МенеджерКартинки.Идентификатор = ТекДанные.Идентификатор;
	МенеджерКартинки.Удалить();
	ОбновитьАдресКартинки()
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Если Вопрос("Удалить запись?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТекДанные = Элементы.Список.ТекущиеДанные;
		УдалитьЗапись(ТекДанные);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗапись(ТекДанные)
	
	Менеджер = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	Менеджер.Объект = ТекДанные.Модель;
	Менеджер.Идентификатор = ТекДанные.Идентификатор;
	Менеджер.Удалить();
	
	Менеджер = РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, ТекДанные);
	Менеджер.Удалить();
		
КонецПроцедуры

&НаКлиенте
Процедура МодельОтборПриИзменении(Элемент)
	
	ОбновитьОтбор()
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветОтборПриИзменении(Элемент)
	
	ОбновитьОтбор()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтбор()
	
	Список.Параметры.УстановитьЗначениеПараметра("Модель", Модель);
	Список.Параметры.УстановитьЗначениеПараметра("Цвет", Цвет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменена картинка авто" Тогда
		ОбновитьАдресКартинки();
		Элементы.АдресКартинки.Обновить();
	КонецЕсли;
	
КонецПроцедуры
